{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"input_4:0": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "24"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}}, {"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/BiasAdd", "op": "_FusedMatMul", "input": ["input_4", "StatefulPartitionedCall/sequential_3/random_fourier_features_1/mul", "StatefulPartitionedCall/sequential_3/random_fourier_features_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/Cos", "op": "Cos", "input": ["StatefulPartitionedCall/sequential_3/random_fourier_features_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/random_fourier_features_1/Cos", "StatefulPartitionedCall/sequential_3/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/mul", "shape": [63, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/random_fourier_features_1/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_2/MatMul/ReadVariableOp", "shape": [4096, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_2/BiasAdd/ReadVariableOp", "shape": [24], "dtype": "float32"}]}]}